src/cf/InformationRegisters/СостоянияБанковскихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияБанковскихДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияБанковскихДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ДокументыИнтеграцииСБанком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДокументыИнтеграцииСБанком</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументовИнтеграцииСБанком</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НастройкаИнтеграции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиИнтеграцииСБанками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.РегламентированныйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОСпецрежимахНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СостоянияБанковскихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияБанковскихДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПодписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/СостоянияБанковскихДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура УстановитьСостояниеДокумента(Документ, СостояниеДокумента, ПереходСРедакции20 = Ложь) Экспорт
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПлатежноеПоручение")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.ПлатежноеТребование") Тогда
		
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "Организация, Проведен, ПометкаУдаления");
		Ссылка			 = Документ;
		Организация		 = РеквизитыДокумента.Организация;
		ДокументПроведен = РеквизитыДокумента.Проведен;
		ПометкаУдаления  = РеквизитыДокумента.ПометкаУдаления;
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументОбъект.ПлатежноеПоручение")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументОбъект.ПлатежноеТребование") Тогда
		
		Ссылка			 = Документ.Ссылка;
		ДокументПроведен = Документ.Проведен;
		Организация		 = Документ.Организация;
		ПометкаУдаления  = Документ.ПометкаУдаления;
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		УдалитьЗапись(Ссылка, Организация);
		ЗарегистрироватьИзменениеСтатусаЗадачиПодготовкиПлатежа(Ссылка, ПереходСРедакции20);
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(СостояниеДокумента) = Тип("Строка") Тогда
		
		Если СостояниеДокумента = "Подготовлено" Тогда
			
			СостояниеДокумента = Перечисления.СостоянияБанковскихДокументов.Подготовлено;
			
		ИначеЕсли СостояниеДокумента = "НаПодписи" Тогда
			
			СостояниеДокумента = Перечисления.СостоянияБанковскихДокументов.НаПодписи;
			
		ИначеЕсли СостояниеДокумента = "Отклонено" Тогда
			
			СостояниеДокумента = Перечисления.СостоянияБанковскихДокументов.Отклонено;
			
		ИначеЕсли СостояниеДокумента = "Отправлено" Тогда
			
			СостояниеДокумента = Перечисления.СостоянияБанковскихДокументов.Отправлено;
			
		Иначе
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаНаОбъект", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияБанковскихДокументов.Организация,
	|	СостоянияБанковскихДокументов.СсылкаНаОбъект,
	|	СостоянияБанковскихДокументов.Состояние
	|ПОМЕСТИТЬ ВТСостоянияБанковскихДокументов
	|ИЗ
	|	РегистрСведений.СостоянияБанковскихДокументов КАК СостоянияБанковскихДокументов
	|ГДЕ
	|	СостоянияБанковскихДокументов.СсылкаНаОбъект = &СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСостоянияБанковскихДокументов.Организация,
	|	ВТСостоянияБанковскихДокументов.СсылкаНаОбъект
	|ИЗ
	|	ВТСостоянияБанковскихДокументов КАК ВТСостоянияБанковскихДокументов
	|ГДЕ
	|	ВТСостоянияБанковскихДокументов.Организация <> &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСостоянияБанковскихДокументов.Организация,
	|	ВТСостоянияБанковскихДокументов.СсылкаНаОбъект,
	|	ВТСостоянияБанковскихДокументов.Состояние
	|ИЗ
	|	ВТСостоянияБанковскихДокументов КАК ВТСостоянияБанковскихДокументов
	|ГДЕ
	|	ВТСостоянияБанковскихДокументов.Организация = &Организация";
	
	Результат = Запрос.ВыполнитьПакет();
	
	// Удаляем запись регистра, если в уже проведенном документе изменили организацию.
	Если Не Результат[1].Пустой() Тогда
		
		Выборка = Результат[1].Выбрать();
		Выборка.Следующий();
		
		УдалитьЗапись(Выборка.СсылкаНаОбъект, Выборка.Организация);
		
	КонецЕсли;
	
	Если Не Результат[2].Пустой() Тогда // уже есть записи в регистре сведений
		
		Выборка = Результат[2].Выбрать();
		Выборка.Следующий();
		Если Выборка.Состояние <> СостояниеДокумента И СостояниеДокумента <> Неопределено Тогда // если состояние не изменилось, регистр не перезаписываем
			
			ЗаписатьСостояние(Ссылка, Организация, СостояниеДокумента, ПереходСРедакции20);
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(СостояниеДокумента) Тогда // еще нет записей в регистре, записываем, если состояние указано
		
		ЗаписатьСостояние(Ссылка, Организация, СостояниеДокумента, ПереходСРедакции20);
		
	ИначеЕсли ДокументПроведен Тогда // если документ проведен, устанавливаем состояние "Подготовлено"
		
		ЗаписатьСостояние(Ссылка, Организация, Перечисления.СостоянияБанковскихДокументов.Подготовлено, ПереходСРедакции20);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТекущееСостояниеДокумента(ДокументСсылка) Экспорт
	
	Если ДокументСсылка.Пустая() Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Результат = Неопределено;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияБанковскихДокументов.Состояние
	|ИЗ
	|	РегистрСведений.СостоянияБанковскихДокументов КАК СостоянияБанковскихДокументов
	|ГДЕ
	|	СостоянияБанковскихДокументов.СсылкаНаОбъект = &СсылкаНаОбъект";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Результат = Выборка.Состояние;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область ОбработчикиОбновления

Процедура ЗаполнитьСостоянияБанковскихДокументов() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлатежноеПоручение.Ссылка,
	|	ПлатежноеПоручение.Проведен,
	|	ПлатежноеПоручение.Организация,
	|	ПлатежноеПоручение.ДокументОснование,
	|	ЕСТЬNULL(СостоянияБанковскихДокументов.Состояние, НЕОПРЕДЕЛЕНО) КАК Состояние
	|ИЗ
	|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияБанковскихДокументов КАК СостоянияБанковскихДокументов
	|		ПО ПлатежноеПоручение.Ссылка = СостоянияБанковскихДокументов.СсылкаНаОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлатежноеТребование.Ссылка,
	|	ПлатежноеТребование.Проведен,
	|	ПлатежноеТребование.Организация,
	|	ЕСТЬNULL(СостоянияБанковскихДокументов.Состояние, НЕОПРЕДЕЛЕНО) КАК Состояние
	|ИЗ
	|	Документ.ПлатежноеТребование КАК ПлатежноеТребование
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияБанковскихДокументов КАК СостоянияБанковскихДокументов
	|		ПО ПлатежноеТребование.Ссылка = СостоянияБанковскихДокументов.СсылкаНаОбъект";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	// Установка состояний платежных поручений
	Выборка = РезультатЗапроса[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Состояние) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		СписаниеСРасчетногоСчета = Документы.ПлатежноеПоручение.НайтиДокументСписания(
			Выборка.Ссылка, Выборка.ДокументОснование);
			
		Если ЗначениеЗаполнено(СписаниеСРасчетногоСчета)
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СписаниеСРасчетногоСчета, "Проведен") Тогда
			
			УстановитьСостояниеДокумента(Выборка.Ссылка, Перечисления.СостоянияБанковскихДокументов.Оплачено, Истина);
			
		ИначеЕсли Выборка.Проведен Тогда
			
			УстановитьСостояниеДокумента(Выборка.Ссылка, Перечисления.СостоянияБанковскихДокументов.Подготовлено, Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗапросПоступленияНаСчет = Новый Запрос;
	ЗапросПоступленияНаСчет.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПоступлениеНаРасчетныйСчет.Ссылка
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчет.ДокументОснование = &ДокументОснование
	|	И ПоступлениеНаРасчетныйСчет.Проведен";
	
	Выборка = РезультатЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Состояние) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ЗапросПоступленияНаСчет.УстановитьПараметр("ДокументОснование", Выборка.Ссылка);
		ВыборкаПоступления = ЗапросПоступленияНаСчет.Выполнить().Выбрать();
		
		Если ВыборкаПоступления.Следующий() Тогда
			
			УстановитьСостояниеДокумента(Выборка.Ссылка, Перечисления.СостоянияБанковскихДокументов.Оплачено, Истина);
			
		ИначеЕсли Выборка.Проведен Тогда
			
			УстановитьСостояниеДокумента(Выборка.Ссылка, Перечисления.СостоянияБанковскихДокументов.Подготовлено, Истина);
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьСостояние(СсылкаНаОбъект, Организация, СостояниеДокумента, ПереходСРедакции20)
	
	ЗаписьРегистра = СоздатьМенеджерЗаписи();
	ЗаписьРегистра.СсылкаНаОбъект = СсылкаНаОбъект;
	ЗаписьРегистра.Организация    = Организация;
	ЗаписьРегистра.Состояние      = СостояниеДокумента;
	ЗаписьРегистра.Записать();
	
	ЗарегистрироватьИзменениеСтатусаЗадачиПодготовкиПлатежа(СсылкаНаОбъект, ПереходСРедакции20);
	
	Если СостояниеДокумента = Перечисления.СостоянияБанковскихДокументов.Оплачено Тогда
		РегистрыСведений.ДокументыИнтеграцииСБанком.УстановитьСостояниеОбменЗавершен(СсылкаНаОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьИзменениеСтатусаЗадачиПодготовкиПлатежа(СсылкаНаОбъект, ПереходСРедакции20)
	
	Если ПереходСРедакции20 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыРасчетаСтатусов = Новый Структура;
	ПараметрыРасчетаСтатусов.Вставить("ПропуститьОбновлениеСвязиДокументЗадача", Истина);
	ВыполнениеЗадачБухгалтера.ЗарегистрироватьИзменениеСтатусаЗадачиПодготовкиПлатежа(
		СсылкаНаОбъект, ПараметрыРасчетаСтатусов);
	
КонецПроцедуры
	
Процедура УдалитьЗапись(СсылкаНаОбъект, Организация)
	
	ЗаписьРегистра = СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Организация = Организация;
	ЗаписьРегистра.СсылкаНаОбъект = СсылкаНаОбъект;
	ЗаписьРегистра.Удалить();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
